[
  {
    "q": "When are scholarships awarded?",
    "a": "Scholarships are awarded in May of each school year, in coordination with the Las Lomas High School senior awards and graduation season. Recipients are notified in advance and may be recognized at a school-wide awards ceremony."
  },
  {
    "q": "How many scholarships are given each year?",
    "a": "Between 5 and 10 scholarships are awarded annually. The number of scholarships depends on the amount of donations received that year and the number of qualified applicants."
  },
  {
    "q": "How much is each scholarship?",
    "a": "Scholarship amounts will vary each year, depending on the total funds raised. Our goal is to distribute 75% of annual donations, reserving 25% to ensure long-term sustainability of the fund. This helps us maintain a legacy that supports future students for years to come."
  },
  {
    "q": "What are your operating costs?",
    "a": "We are committed to keeping operating costs minimal. Less than 5% of annual funds are allocated to necessary expenses such as:\n\n• Business banking and credit card processing fees\n• Printed materials or promotional efforts to increase awareness\n• Website maintenance\n\nWe are a community-driven initiative with all board members serving on a volunteer basis."
  },
  {
    "q": "Are scholarships based only on grades?",
    "a": "No. While academic performance is considered, scholarships are not awarded solely on GPA or test scores. We also evaluate:\n\n• Personal character\n• Community service\n• Financial need\n• Leadership\n• Resilience and personal growth\n• Dominic Paul Maron Ferrell has specific qualifications and attributes\n\nOur goal is to recognize well-rounded individuals who embody the spirit of the Las Lomas Knights Legacy."
  },
  {
    "q": "Can funds be used for trade schools or military?",
    "a": "Yes! The Knights Legacy Fund supports a wide range of post-high school paths, including:\n\n• 2-year community colleges\n• 4-year colleges or universities\n• Trade or vocational schools\n• Accredited certification programs\n• Military enlistment or academies\n\nWe believe in supporting all pathways to success."
  },
  {
    "q": "Who selects the recipients?",
    "a": "Scholarship recipients are selected by the Knights Legacy Fund Board of Advisors, in collaboration with a non-biased school representative. For named or donor-specific scholarships (like the Dominic Paul Maron Ferrell Scholarship), family representatives such as Christine Maron may participate in interviews and final selection. The process is designed to ensure fairness, transparency, and alignment with the values of the fund."
  },
  {
    "q": "Is the fund sustainable long-term?",
    "a": "The Knights Legacy Fund is designed as a long-term, sustainable program, with the goal of offering scholarships annually for generations to come. By reserving 25% of each year’s donations, we’re building a strong foundation to support future students."
  },
  {
    "q": "How do I join the board?",
    "a": "To maintain a non-biased and diverse board, new members are selected through a nomination and interview process facilitated by the current board and a Las Lomas school representative. Board positions are available to students (incoming freshmen through seniors), alumni, parents, and community members who want to serve the mission of the fund."
  },
  {
    "q": "Can the by-laws be changed?",
    "a": "Yes, but only with oversight. The board follows a set of ratified by-laws, which are reviewed annually. Any proposed changes must be:\n\n• Voted on and approved by a majority of the board\n• Reviewed and approved by the Las Lomas High School representative.\n\nThis ensures continuity, transparency, and alignment with the mission."
  },
  {
    "q": "Can I create a named scholarship?",
    "a": "Yes. We welcome donations made in honor or memory of a loved one, teacher, or classmate. If you would like to establish a named scholarship or dedicate funds in someone’s name, contact us."
  },
  {
    "q": "Are donations tax-deductible?",
    "a": "Yes. The Knights Legacy Fund operates under the umbrella of a registered nonprofit organization. Donations are tax-deductible to the extent allowed by law. Tax receipts will be provided for all qualifying donations."
  },
  {
    "q": "How do students apply?",
    "a": "Each year, the scholarship application opens in early spring, and includes:\n\n• A short application form\n• A personal statement or essay\n• A letter of recommendation\n\nMore details, including exact dates and instructions, will be posted on our website and shared through the Las Lomas Career and College Center."
  },
  {
    "q": "How can I get involved?",
    "a": "We’re always looking for volunteers, sponsors, and community partners. You can:\n\n• Join a committee or volunteer at events\n• Become a sponsor or donor\n• Help with outreach or student mentoring\n\nContact us if you want to help and get involved!"
  },
  {
    "q": "What is your EIN?",
    "a": "33-3823929"
  }
]